{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "Hey",
                "What's up",
                "Hello",
                "Yo",
                "Is anyone there?",
                "Howdy",
                "How's it going",
                "Hi there",
                "Good day"
            ],
            "responses": [
                "Hello there!",
                "Howdy, partner!",
                "*sick guitar solo*",
                "Hello, what can I do for you?",
                "Hi there, how can I help you?"
            ]
        },
        {
            "tag": "guitar riff",
            "patterns": [
                "I want to learn something new",
                "Do you have any sick guitar riffs that I could learn?",
                "I want to learn a new guitar riff",
                "Teach me a guitar riff"
            ],
            "responses": [
                "Check this out. 'Sunshine of Your Love' by Cream: D|--12--12--10--12--7-6-5-0-3--0---|",
                "I've got you. 'Running Down A Dream' by Tom Petty: E|-0-7-0-6-0-5-0-3-0---|",
                "Here's the absolute banger. 'Seven Nation Army' by The White Stripes: A|--7---7-10--7--5--3--2----|"
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Goodbye",
                "Bye",
                "See ya",
                "See you later",
                "Thank you and goodbye",
                "Thanks for the help"
            ],
            "responses": [
                "*sick guitar solo*",
                "Come back soon",
                "Come back any time",
                "Stay safe, neither of us want to see you go hollow",
                "Have a nice day",
                "See you, thanks for using the app"
            ]
        },
        {
            "tag": "funny",
            "patterns": [
                "Tell me a joke",
                "Do you know any jokes?",
                "Tell me something funny"
            ],
            "responses": [
                "Why was the guitar teacher arrested? For fingering A minor.",
                "Why couldn’t the fisherman play his guitar? Because he lost his tuna.",
                "Why can’t Woody play his guitar? He doesn’t know where his Pixar.",
                "What do you call a female police officer who plays the guitar? SHE RIFF.",
                "Why was the guitarist late for work? He got caught in a jam.",
                "I’m so sick of people thinking they can just waltz into my room when I’m listening to music in 4/4.",
                "What’s the difference between a guitar & a ukulele? It only takes you half as long to burn a ukulele.",
                "How do you get a million dollars? Start with 2 million and try to make a living playing the guitar.",
                "What do you call a guitar player with half a brain? Gifted.",
                "Do you know what’s the difference between a guitarist and a sofa? The sofa can support a family.",
                "What do you call a successful guitarist? A guy whose wife has 2 jobs.",
                "Why don’t bass players like dating guitar players? Too much treble.",
                "Why can’t bass players get through a door? He either can’t find the key, or he doesn’t know when to come in!",
                "Why did Darth Vader search the guitar shop? To find the hidden rebel bass.",
                "What is Beethoven doing now? De-composing.",
                "My girlfriend asked if I could play Wonderwall on the guitar. I said “maybe”."
            ]
        }
    ]
}